z = {1,2,3,4,5}
x = {3,4,5,6,7}
##z.add(6) #метод добавления в м-во
##z.discard(7) #удаление э-та из м-ва, если этого э-та нет ошибки не будет
##z.remove(6) #удаление э-та из м-ва, если этого э-та нет будет ошибка
##y = z.union(x) #объеденить два мн-ва и сохранить в новую переменную
##print(y)
##z.update(x) #объеденить два мн-ва без сохранения в новую переменную
##t = z.intersection(x) #определяет пересечение множеств+сохраняем в новую п-ую
##print(t)
e = z.difference(x) #разница между мн-ми
print(e)
